Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས།
en: He searched for Ratnacūḍa, the head-merchant patron of the Dharma.

source: ཚོང་འདུས་ཀྱི་སྲང་ཞིག་ན་འདུག་པ་མཐོང་ནས། དེས་དེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: He saw him in the middle of a market. Sudhana bowed his head to Ratnacūḍa’s feet, circumambulated Ratnacūḍa, keeping him to his right, many hundreds of thousands of times, and sat down before him.

source: མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ན།
en: With his hands together in homage, he said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ལམ་གང་གིས་བདག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་མ་ན་ངག་ལེགས་པར་མྱི་སྩལ་ཏམ།
en: “Ārya, will you not bestow on me the instruction for the bodhisattva path, which is the path by which I will become omniscient?”

source: དེ་ནས་ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་ལག་པ་ནས་བཟུང་སྟེ། རང་གི་ཁྱིམ་གང་ན་བ་དེར་ཁྲིད་དེ་ཁྱིམ་དེ་བསྟན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོའི་ཁྱིམ་ལ་ལྟོས་ཤིག་ཅེས་ནས།
en: Ratnacūḍa, the head-merchant patron of the Dharma, grasped the hands of Sudhana, the head merchant’s son, led him to his home and, showing Sudhana his home, said, “Noble one, look at my home!”

source: དེས་བལྟས་ན་ཁྱིམ་དེ་དག་ཅིང་འོད་གསལ་བ་འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་ལས་བྱས་པ་སྟེ།
en: Sudhana looked at it. The house was made of pure, bright Jambu River gold.

source: ཡངས་ཤིང་མཐོ་ལ་དངུལ་གྱི་ར་བས་བསྐོར་བ།
en: It was vast and tall and encircled by a wall of silver.

source: ཤེལ་གྱི་རྩིག་པས་ཤིན་ཏུ་ལེགས་པར་བརྩིགས་ཏེ། མཛེས་པར་བྱས་བ།
en: It was beautified by arrangements of bright crystals.

source: བཻ་ཌཱུརྱའི་ཕུང་པོ་བརྒྱ་ཕྲག་སྟོང་གིས་རབ་ཏུ་བརྒྱན་པ། མུས་རག་ལ་པའི་ཀ་བ་བཀྱེ་བ།
en: It was adorned by a hundred thousand clusters of beryls.

source: མུ་ཏིག་དམར་པོ་ལས་བྱས་པའི་སེང་གེའི་ཁྲི་ཤིན་ཏུ་བཤམས་པ།
en: There was an array of pillars of white coral. A lion throne made of red pearls had been erected.

source: ནོར་བུ་རིན་པོ་ཆེ་རང་བཞིན་སྣང་བའི་སེང་གེའི་རྒྱལ་མཚན་བསྒྲེང་བ།
en: Lion banners made of asteria jewels were displayed.

source: ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་བླ་རེ་བྲེས་པ།
en: Overhead there was a shining canopy of jewels.

source: གསེར་གྱི་དྲ་བ་ཡིད་བཞིན་གྱི་ནོར་བུས་བརྒྱན་པས་ཀུན་ནས་ཡོག་པ།
en: It was draped in nets of gold adorned with wish-fulfilling jewels.

source: ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་གྲངས་མྱེད་པས་རབ་ཏུ་བརྒྱན་པ།
en: There was an array of countless varieties of precious jewels.

source: ཨ་སྨ་གར་བྷ་ལས་བརྩིགས་པའི་རྫིང་བུ་ཆུ་བསིལ་བས་གང་བ་དང་ལྡན་པ།
en: It was furnished with ponds made of emerald and filled with cool water.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཤིང་གིས་བསྐོར་བ།
en: It was encircled by trees made of precious materials.

source: རྒྱ་ཆེ་ཞིང་ཡངས་པ་རིམ་པ་བཅུར་བརྩེགས་པ།
en: It was massive. It was vast. It had ten stories.

source: ཤིན་ཏུ་མཐོ་བ།
en: It was very tall.

source: སྒོ་བརྒྱད་དང་ལྡན་པར་འདུག་པ་མཐོང་ནས།
en: It had eight doors.

source: དེས་ཁྱིམ་དེའི་ནང་དུ་ཕྱིན་ཏེ།
en: Sudhana went inside and looked around.

source: ཀུན་ཏུ་བལྟས་ན་རིམ་ཁང་ཐ་མའི་ནང་ན་བཟའ་བ་དང་བཏུང་བའི་རྣམ་པ་ཡོངས་སུ་གཏོང་བ་མཐོང་ངོ་།
en: On the first floor he saw food and drink being distributed.

source: རིམ་ཁང་གཉིས་པའི་ནང་ན་གོས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་མཐོང་ངོ་།
en: On the second floor he saw clothing being given away.

source: །རིམ་ཁང་གསུམ་པའི་ནང་ན་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱན་དང་། ལྷབ་ལྷུབ་ཡོངས་སུ་གཏོང་བ་མཐོང་ངོ་།
en: On the third floor he saw jewelry and adornments being given away.

source: རིམ་ཁང་བཞི་པའི་ནང་ན་བཙུན་མོའི་འཁོར་དགའ་བའི་ཡོ་བྱད་དུ་བྱ་བ་བུད་མེད་རིན་པོ་ཆེས་ཆེན་པོའི་སྟེང་ན་གཟུང་དུ་བྱ་བ་ཡོངས་སུ་གཏོང་བ་མཐོང་ངོ་།
en: On the fourth floor he saw being given away the most precious, excellent maidens on the great earth who are the pleasures enjoyed in harems.

source: །རིམ་ཁང་ལྔ་པའི་ནང་ནས་ལྔ་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཡང་དག་པར་བགྲོ་བའི་དགའ་བ་ལ་མོས་པ། འཇིག་རྟེན་ལ་ཕན་པ་དང་། བདེ་བའི་སེམས་ཀྱི་སྤྱོད་པ་དང་ལྡན་པ། གཙུག་ལག་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པ་གཟུངས་ཀྱི་ཚུལ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕྱག་རྒྱ་དང་། ཏིང་ངེ་འཛིན་ལས་རྣམ་པར་ལྡང་བ་དང་། ཏིང་ངེ་འཛིན་ལ་རྣམ་པར་དཔྱད་པ་དང་། ཡེ་ཤེས་ཀྱི་སྣང་བ་མངོན་པར་སྒྲུབ་པ་འདུས་ཤིང་འཁོད་པར་མཐོང་ངོ་།
en: On the fifth floor he saw an assembly of bodhisattvas on the fifth bhūmi who were dedicated to the pleasure of talking together about the Dharma, whose thoughts were concerned with the benefit and happiness of the world, who were accomplished in all treatises, who had the power of retention, who had the seal of samādhi, who rose from samādhi, who analyzed samādhi, and who had attained the light of wisdom.

source: །རིམ་ཁང་དྲུག་པའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་རབ་ཏུ་ཐོབ་པ་ཤེས་རབ་ཤིན་ཏུ་ཟབ་པ། རབ་ཏུ་ཞི་བའི་ཆོས་ཐམས་ཅད་མངོན་པར་ཤེས་པ། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། སྙིང་པོ་མང་པོས་སྒོ་ཀུན་ནས་བྱུང་པ། བསྒྲིབས་པ་མྱེད་པའི་སྤྱོད་ཡུལ་ཅན་མྱི་གཉིས་པ་ལ་ཡང་དག་པར་སྤྱོད་པ། ཆོས་ཡང་དག་པར་བགྲོ་བ་ལ་རྣམ་པར་འཕྲུལ་བ།
en: On the sixth floor he saw bodhisattvas who had attained the state of the perfection of wisdom, who had profound wisdom, who had clairvoyantly perceived the pacification of all phenomena, who came forth from all the gateways that were the essences and gateways of the samādhis and retentions, whose range of activity was free of obscuration, who practiced nonduality, who manifested discussions of the Dharma, and who followed the way of the perfection of wisdom, analyzed it, elucidated it, and discussed the many gateways to the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུད་ཀྱི་རྗེས་སུ་འབྲང་ཞིང་རྣམ་པར་དབྱེ་བ་དང་། རབ་ཏུ་གསལ་བར་བྱེད་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མང་པོ་ཡང་དག་པར་བགྲོ་བ་བྱེད་པ་རྣམས་ཀུན་ནས་འདུས་ཤིང་འཁོད་པ་མཐོང་སྟེ། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཞི་བའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འགྲོ་བ་ཐམས་ཅད་དུ་ཡེ་ཤེས་རྣམ་པར་ཕྱེ་བ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མྱི་གཡོ་བའི་ཀློང་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་རྡུལ་དང་བྲལ་བའི་འོད་ཅེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཐུབ་པར་དཀའ་བ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འགྲོ་བ་ཐམས་ཅད་མོས་པར་བྱེད་ཅིང་རྗེས་སུ་འབྲང་བའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཕྱི་བཞིན་འབྲང་བའི་ཚུལ་གྱི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཀུན་ཏུ་ལྟ་བའི་བཏང་སྙོམས་ཐོབ་པ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་མི་ཟད་པའི་མཛོད་དང་ལྡན་པ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་འགྲོ་བ་རྒྱ་མཚོའི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཐོགས་པ་མྱེད་པའི་སྤོབས་པ་ཞེས་བྱ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་ཆོས་ཀྱི་སྤྲིན་ལ་དམྱིགས་པས་རིམ་པས་མྱི་དམྱིགས་པའི་གནས་ཤེས་བྱ་བ་དང་། དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒོ་དེ་དག་ལ་སྩོགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གྲངས་མྱེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བར་ཡང་དག་པར་བགྲོ་བ་བྱེད་ཅིང་།
en: These included the gateway to the perfection of wisdom called the essence of peace , the gateway to the perfection of wisdom called the categories of wisdom for all beings , the gateway to the perfection of wisdom called the unwavering turning , the gateway to the perfection of wisdom called the dust-free light , the gateway to the perfection of wisdom called the essence of invincibility , the gateway to the perfection of wisdom called the illumination of beings , the gateway to the perfection of wisdom called the field of the way that is followed , the gateway to the perfection of wisdom called the essence of the ocean , the gateway to the perfection of wisdom called the attainment of all-seeing equanimity , the gateway to the perfection of wisdom called the possession of inexhaustible treasure , the gateway to the perfection of wisdom called the ocean of the ways of the Dharma , the gateway to the perfection of wisdom called following the ocean of beings , the gateway to the perfection of wisdom called unimpeded eloquence , and the gateway to the perfection of wisdom called resting in objectlessness after focusing on the clouds of the Dharma . They discussed the perfection of wisdom through countless millions of such gateways to the perfection of wisdom in a countless array of separate gatherings of assemblies of bodhisattvas.

source: རྒྱན་བརྗོད་དུ་མྱེད་པ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་འཁོད་པ་མཐོང་བར་གྱུར་ཏོ། །རིམ་ཁང་བདུན་པའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་སྒྲ་བརྙན་ལྟ་བུའི་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཐབས་དང་ཡེ་ཤེས་རྣམ་པར་གདོན་མི་ཟ་བ་ལ་ཤིན་ཏུ་བྱུང་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡང་དག་པར་འཛིན་པ་ཤ་སྟག་འདུས་ཤིང་འཁོད་པ་མཐོང་ངོ་། །རིམ་ཁང་བརྒྱད་པའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་མ་ཉམས་པར་འགྲོ་བའི་མངོན་པར་ཤེས་པ་རབ་ཏུ་ཐོབ་པ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་རྣམ་པར་རྒྱུ་བ།
en: On the seventh floor he saw an assembly of bodhisattvas who had all attained the patience of perceiving everything as echoes, who had given rise to infallible wisdom and method, and who had received the clouds of the Dharma from all tathāgatas.

source: འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་གཟུགས་བརྙན་རབ་ཏུ་འབྱུང་བ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ལུས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ནས་གུད་དུ་མི་འཕགས་པའི་ཡུལ་དང་ལྡན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་ལ་ཡང་དག་པར་གཞོལ་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་སྔོན་དུ་བརྗོད་པའི་གཏམ་གྱི་སྐྱེས་བུར་གྱུར་པ་ཤ་སྟག་ཀུན་ནས་འདུས་ཤིང་འཁོད་པ་མཐོང་ངོ་།
en: On the eighth floor he saw an assembly of bodhisattvas who had all attained clairvoyance that would never diminish, who moved within all world realms, whose images appeared within all the gathered assemblies, whose bodies were distributed throughout the entire realm of phenomena, whose field of experience never departed from being at the feet of all the tathāgatas, who encountered the bodies of all the buddhas, and who were the first individuals to speak within the assemblies of the followers of all the tathāgatas.

source: །རིམ་ཁང་དགུ་བའི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཚེ་གཅིག་གིས་ཐོགས་པ་ཤ་སྟག་འདུས་ཤིང་འཁོད་པ་མཐོང་ངོ་།
en: On the ninth floor he saw an assembly of bodhisattvas who were all in their final lifetime.

source: རིམ་ཁང་བཅུ་པའི་ནང་ན་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཐོག་མ་བྱང་ཆུབ་ཏུ་ཐུགས་བསྐྱེད་པ་དང་། སྤྱོད་པ་དང་། འབྱུང་བ་དང་། སྨོན་ལམ་རྒྱ་མཚོ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་བའི་ཡུལ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་བཅས་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྒྲོག་པ་དང་བཅས་པ་དང་། སེམས་ཅན་འདུལ་བ་མཛད་པའི་བྱིན་གྱིས་རླབས་དང་བཅས་པར་མཐོང་ངོ་།
en: On the tenth floor he saw when all the tathāgatas first developed the aspiration for enlightenment, their conduct, their setting forth, their oceans of prayers, the range of their buddha miracles, their buddha realms, all their circles of followers, their teaching the wheel of the Dharma, and their power to guide beings.

source: །མཐོང་ནས་ཀྱང་ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་ཁྱོད་ལ་འདི་ལྟ་བུའི་ཕུན་སུམ་ཚོགས་པ་མངའ་ན། ཕུན་སུམ་ཚོགས་པའི་རྣམ་པ་དེ་ཅི་ལྟ་བུ་ཞིག་ཏུ་སྦྱང་བ་མཛད་མཛད།
en: When he had seen this, he asked Ratnacūḍa, the head-merchant patron of the Dharma, “Ārya, how did you gain this pure good fortune?

source: དགེ་བའི་རྩ་བ་ནི་སུ་ཞིག་ལ་ཡོངས་སུ་བསྐྲུན་བསྐྲུན།
en: How did you plant the roots of merit that have ripened in this way?”

source: དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་བོས་དྲན་ཏེ། འདས་པའི་དུས་ཀྱི་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འདས་པའི་ཡང་ཕ་རོལ་ཅིག་ན། འཇིག་རྟེན་གྱི་ཁམས་འཁོར་ལོ་སྣ་ཚོགས་ཞེས་བྱ་བར། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་འོད་གཟེར་མཐའ་ཡས་པས་ཡོངས་སུ་བརྒྱན་པའི་ཆོས་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། བླ་ན་མྱེད་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་བྱུང་སྟེ། དེ་བཞིན་གཤེགས་པ་དེ་ཡེ་ཤེས་རྣམ་པར་སྣང་བ་ལ་སྩོགས་པ་ཉན་ཐོས་བྱེ་བ་ཕྲག་བརྒྱད་དང་། ཡེ་ཤེས་ཉི་མའི་གཟི་བརྗིད་ལ་སྩོགས་པ།
en: Ratnacūḍa answered, “Noble one, I remember that in the past, more kalpas ago than there are atoms in a buddha realm, there was a world realm called Cakravicitra, and in that world appeared a tathāgata, an arhat, a samyak­saṃbuddha, one with wisdom and conduct, a sugata, one who knows the world’s beings, an unsurpassable guide who tames beings, a teacher of devas and humans, a buddha, a bhagavat named Ananta­raśmi­dharma­dhātu­samalaṃkṛta­dharma­rāja.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དང་། ཐབས་གཅིག་ཏུ་རྒྱལ་པོ་ཆོས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོས་སྤྱན་དྲངས་ནས། བཟའ་ཤང་གི་ར་བ་ཆེན་པོ་རིན་པོ་ཆེ་རྒྱལ་མཚན་རྒྱན་གྱིས་མཛེས་པ་ཞེས་བྱ་བར་གཤེགས་ཏེ།
en: That tathāgata, together with a billion śrāvakas, such as Jñānavairocana, and a trillion bodhisattvas, such as Jñāna­sūrya­tejas, having been invited by King Dharmeśvara­rāja, went to the great park called Maṇi­dhvaja­vyūha­rāja.

source: དེ་བཞིན་གཤེགས་པ་དེ་གྲོང་ཁྱེར་དུ་གཤེགས་ནས། ཚོང་འདུས་ཀྱི་སྲང་ནས་ཚུར་བཞུད་པའི་ཚེ། ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར། སིལ་སྙན་དང་རོལ་མོའི་སྒྲ་ཞིག་ཀྱང་ཕྱུང་། སྤོས་ཀྱི་རི་ལུ་གཅིག་ཅིག་ཀྱང་བསྲེགས་ཏེ།
en: “When the Tathāgata had entered the town and was passing through the market, in order to make an offering to the Tathāgata and his saṅgha of bodhisattvas and śrāvakas, I played music and burned a pellet of incense to spread the aroma.

source: བདུག་སྤོས་ཀྱིས་བསངས་སོ། །སྤོས་ཀྱི་རི་ལུ་གཅིག་པོ་དེ། དེ་ལྟར་བསྲེགས་པས་ཞག་བདུན་དུ་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱང་སྤོས་ཀྱི་ན་བུན་གྱི་སྤྲིན་ཁ་དོག་སྣ་ཚོགས་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་འདྲ་བས་ཡོངས་སུ་ཁེབས་པར་གྱུར་ཏོ།
en: By burning that pellet of incense, the entirety of Jambudvīpa was covered for seven days with multicolored clouds of perfume that took on the forms of all beings.

source: །སྤོས་ཀྱི་ན་བུན་གྱི་སྤྲིན་དེ་དག་ལས་ཀྱང་སྒྲ་འདི་སྐད་དུ་བརྗོད་དེ།
en: “From those clouds of perfume came these words:

source: དེ་བཞིན་གཤེགས་པ་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་སྟེ། དུས་གསུམ་དུ་དྲིམ་མྱེད་པའི་ཡེ་ཤེས་ཀྱི་ཕུང་པོ་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པ་སྟེ།
en: ‘The tathāgatas have an inconceivable accumulation of the stainless knowledge of the three times.

source: སྒྲིབ་པ་ཐམས་ཅད་མྱི་མངའ་བའོ།
en: That omniscience is free of all obscuration.

source: ཉོན་མོངས་པའི་བག་ཆགས་ཐམས་ཅད་ཡོངས་སུ་སྦྱངས་པ་སྟེ།
en: They have eliminated all the propensities for kleśas.

source: དེ་བཞིན་གཤེགས་པ་ལ་ཡོན་ཕུལ་བ་ཐམས་ཅད་ཀྱང་། ཐམས་ཅད་མཁྱེན་པའི་དོན་ཆེན་པོ་ཚད་མྱེད་པ་བསྒྲུབ་པར་འགྱུར་རོ།
en: All that is offered to the tathāgatas will bring the immeasurable great result of omniscience.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡང་དག་པར་གཞོལ་བར་འགྱུར་རོ་ཞེས།
en: It will unite you with omniscience.’

source: དེ་སྐད་དུ་ཁོ་བོའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་དགེ་བའི་རྩ་བ་ལ་ཤུགས་ཡང་དག་པར་བསྐྱེད་པའི་ཕྱིར། སྤོས་ཀྱི་ན་བུན་གྱི་སྤྲིན་དེ་ལས། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་བརླབས་ཀྱིས་སྒྲའི་རྣམ་པ་དེ་ལྟ་བུ་བྱུང་ངོ་།
en: “Those words were emitted from those masses of clouds of incense through the blessing of the Buddha in order to ripen my roots of merit and increase the power of the roots of merit of countless beings.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་བརླབས་ཀྱིས། བསྟན་པའི་ཆོ་འཕྲུལ་གྱི་དགེ་བའི་རྩ་བ་དེ་ཡང་ཁོ་བོས་གནས་གསུམ་དུ་ཡོངས་སུ་བསྔོས་ཏེ།
en: “Noble one, I dedicated the roots of merit from the manifestation of that miracle to three objectives through the blessing of the Tathāgata.

source: གསུམ་གང་ཞེ་ན།
en: What are those three?

source: འདི་ལྟར་ཕོངས་པ་ཐམས་ཅད་ཤིན་ཏུ་རྒྱུན་གཅད་པ་དང་། དམ་པའི་ཆོས་མཉན་པ་དང་མྱི་འབྲལ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཐོང་བ།
en: I made the dedication so that I would have the complete vision of all kalyāṇamitras, of all buddhas, and of all bodhisattvas.

source: ཡོངས་སུ་རྫོགས་པར་འགྱུར་བར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཐོགས་པ་མྱེད་པའི་རྒྱན་ཅེས་བྱ་བ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་རིན་པོ་ཆེ་ཚད་མྱེད་པའི་འབྱུང་གནས་སུ་གྱུར་པ། སངས་རྒྱས་ཀྱི་སྐུ་རྒྱ་མཚོ་དང་། ཐ་མྱི་དད་པ་ལ་ཞུགས་པ། ཐ་མྱི་དད་པའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡང་དག་པར་འཛིན་པ། ཐ་མྱི་དད་པའི་ཡོན་ཏན་རྒྱ་མཚོ་ལ་ཞུགས་པ། ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པའི་དྲ་བ་རྣམ་པར་རྒྱས་པར་གྱུར་པ།
en: “Noble one, I know only this bodhisattva liberation called the unimpeded display of the field of prayer

source: ཏིང་ངེ་འཛིན་ཐ་མྱི་དད་པའི་ཡུལ་ལ་ཞུགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཐ་མྱི་དད་པས་དགེ་བའི་རྩ་བ་རྒྱུན་གཅིག་ཏུ་གྱུར་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་ཐ་མྱི་དད་ཅིང་རྣམ་པར་མྱི་རྟོག་པར་སྤྱོད་པ། དུས་གསུམ་ཐ་མྱི་དད་པས་མཉམ་པ་ཉིད་ལ་ཞུགས་པ། བསྐལ་པ་ཐམས་ཅད་ཐ་མྱི་དད་པར་ཡོངས་སུ་གནས་པས་མྱི་སྐྱོ་བ། ཀུན་ཏུ་ལྟ་བ་ཐ་མྱི་དད་པའི་ཡུལ་གྱི་ས་ལ་གནས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know the conduct or describe the qualities of the bodhisattvas who are the source of limitless good qualities, who have entered an unalloyed ocean of buddha bodies, who have received the rain from unalloyed Dharma clouds, who have entered an ocean of unalloyed qualities, who have extended the net of completely good conduct, who have entered the range of unalloyed samādhis, who have the unalloyed continuous roots of merit of all bodhisattvas, who have the unalloyed nonconceptual conduct of all the tathāgatas, who have entered the unalloyed equality of the three times, who have the unalloyed ability to dwell tirelessly in all kalpas, and who reside on the level of an unalloyed complete range of vision?

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་སྦའི་རྩ་བ་ཞེས་བ་བ་ཡོད་དེ།
en: In this southern region there is a land called Vetramūlaka.

source: དེའི་གྲོང་ཁྱེར་ཀུན་ནས་སྒོ་ཞེས་བྱ་བ་ན། ཚོང་དཔོན་སྤོས་འཚོང་ཀུན་ཏུ་ལྟ་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: There, in a town called Samanta­mukha, dwells a perfume-seller head merchant by the name of Samanta­netra.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཀྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་ཆེན་པོའི་མདོ། །བམ་པོ་གཉིས་པ།
en: Sudhana bowed his head to the feet of Ratnacūḍa, the head-merchant patron of the Dharma, circumambulated Ratnacūḍa, the head-merchant patron of the Dharma, many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from Ratnacūḍa, the head-merchant patron of the Dharma.
